[A_Navigation_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Navigation"
mTooltip="The hero is 50% faster when sailing with a ship."

[A_Exploration_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_FamiliarTerrain_Buff H7BaseBuff]
mName="Familiar Terrain"
mTooltip="Avoids %res of incoming damage"

[A_Snatch_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Snatch"
mTooltip="The hero does not spend Movement to pick up resources, access buildings and other similar actions."

[A_NativeTerrain_Buff H7BaseBuff]
mName="Native Terrain"
mTooltip="Spends 10% less movement points in this town's area of control"

[A_FamiliarTerrain_TownAbility H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Familiar Terrain"
mTooltip=""

[A_Pathfinding_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Pathfinding"
mTooltip="Reduces the penalty for moving on rough terrain by 50%."

[A_Scouting_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Scouting"
mTooltip="The hero’s scouting range is increased by %stat.norm.\nThe hero can see the precise creature numbers of armies and enemy heroes' boosts if they are in scouting range."

[A_Exploration_Skill H7Skill]
mDescriptions[0]="Increases the hero's Movement."
mDescriptions[1]=""
mDescriptions[2]="Increases the hero's Movement by %stat1.norm %stat1.icon."
mDescriptions[3]="Increases the hero's Movement by additional %stat1.norm %stat1.icon."
mDescriptions[4]="Increases the hero's Movement by additional %stat1.norm %stat1.icon."
mName="Exploration"
mTooltip="Explorer Skill Tooltip"

[A_FamiliarTerrain_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Familiar Terrain"
mTooltip="Your units avoid %buff1.buff.res of incoming damage."

[A_NativeTerrain_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Native Terrain"
mTooltip="Governor: Your heroes spend 10% less movement points while moving in this town's area of control"

[A_Rover_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Rover"
mTooltip="Hero's units receive %buff1.buff.stat1 %buff1.buff.stat1.icon Initiative and %buff1.buff.stat2 %buff1.buff.stat2.icon movement range"

